# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionTypeSet..::..Insert Method
MullionTypeSet Class See Also
---
Insert the specified mullion type into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	MullionType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As MullionType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	MullionType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..MullionTypeThe mullion type to be inserted into the set.
# ### Return Value
Returns whether the mullion type was inserted into the set.
# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace